#+name: homeurl
#+BEGIN_SRC sh
echo "gnomesoup.duckdns.org"
#+END_SRC

#+RESULTS:
: gnomesoup.duckdns.org
